# 1. Вводится два слова с клавиатуры. Нужно вывести какое слово длиннее.
# Учесть вариант, что они могут быть равны.
# str1 = input('Введите первое слово: ')
# str2 = input('Введите второе слово: ')
# if str1 > str2:
#     print(str1)
# elif str2 > str1:
#     print(str2)
# else:
#     print('Два слова одинаковы по длине')
#
# 2. Вводится число, как строка, в клавиатуры.
# Необходимо проверить делится ли оно на 5 и вывести «Yes» или «No».
# Также проверить делится ли оно на 4 и вывести «Yes» или «No».
# Подсказка: Число делится на 5, если оканчивается на 0 или 5.
# Число делится на 4, если две последние его цифры — нули или образуют число, которое делится на 4.
# str1 = input('Введите число: ')
# num1 = int(str1)
# if (num1  % 5 == 0) or (num1 % 4 == 0):
#     print('yes')
# else:
#     print('no')
#
# 3. Случайное число от 1 до 12 (номер месяца), использовать random.
# Нужно вывести какой это сезон года (зима, весна, лето, осень).
# import random
# random_num1 = random.randint(1,12)
# if (random_num1 == 2) or (random_num1 == 1) or (random_num1 == 12) :
#    print('зима')
# elif (random_num1 == 3) or (random_num1 ==  4) or (random_num1 ==  5):
#         print('весна')
# elif (random_num1 == 6) or (random_num1 ==  7) or (random_num1 ==  8):
#         print('лето')
# elif (random_num1 == 9) or (random_num1 == 10) or (random_num1 == 11):
#         print('осень')
#
# 4. *Вводитcя четыре числа от 1 до 8 каждое,
# задающие номер столбца и номер строки сначала для первой клетки,
# потом для второй клетки на шахматной доске. Ладья ходит по горизонтали или вертикали.
# Определите, может ли ладья попасть с первой клетки на вторую одним ходом.
# Пример:
# входные данные:
# Введите номер столбца: 4
# Введите номер строки: 4
# Введите номер столбца: 5
# Введите номер строки: 5
# выходные данные: No
# * Дополнительно можно сделать для ферзя (ходит по диагонали, горизонтали или вертикали) и коня (ходит буквой Г).
# num1 = int(input('Введите номер столбца: '))
# num2 = int(input('Введите номер строки: '))
# num3 = int(input('Введите номер столбца: '))
# num4 = int(input('Введите номер строки: '))
# if num1 == num3 or num2 == num4:
#     print('Yes')
# else:
#     print('NO')
