#    Яковлев Евгений

# 1. Дана строка.
# Нужно вывести в первой строке 3, 5 и 6 символы.
# Во второй строке вывесите подстроку,состоящую из 3 символов, начиная с 1 позиции.
# В третьей строке выведите последние 4 символа.
# В четвертой строке выведите символы через один в обратном порядке.

# str1 = "Hello_, my name is Petya, str"
# print(str1[3],str1[5],str1[6])
# print(str1[ : 3])
# print(str1[-4 : ])
# print(str1[ : : -1])

#
# 2. Вводится трёхзначное число в клавиатуры.
# Необходимо вывести последние 2 символа через запятую (использую строки).
# Пример:
# входные данные: 189
# выходные данные: 8,9
# Подсказка: нужно перевести число в строку, потом выделить последние 2 символа.
# num1 = int(input('Введите трехзначное число: '))
# str1 = str(num1)
# str2 = str1[-2: ]
# str3 = ",".join(str2)
# print(str3)

#
# 3. Дана строка с пробелами. Выведите последние слово,
# затем проверьте состоит ли оно только из букв.
# str1 = 'My name is Petya'
# str2 = str1.split()
# print(str2[-1])
# print(str1.isalpha())


#
# 4. Дана строка, нужно выделить все четные символы, потом все нечетные.
# Затем соединить в одну строку и вывести.
# str1 = 'My name is Petya'
# print(str1[ : : 2] + str1[1: : 2])
#
# 5.* Замените все символы “#” на “/” в строке, которая вводится с клавиатуры.
# Подсказка: используя гугл, почитать про метод replace()
# stroka = 'sadklkjdas##'
# str1 = stroka.replace('#','/')
# print(str1)

